app/controllers/comments_controller.rb

    def create
        user = User.find_by(username: comment_params[:user])
        comment = Comment.new(event_id: comment_params[:event_id], content: comment_params[:content])
        comment[:user_id] = user.id
        comment.save
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Dan"], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "event_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["event_id", 1], ["content", "comment"], ["created_at", "2020-02-24 14:40:35.438867"], ["updated_at", "2020-02-24 14:40:35.438867"]]

    def get_event_comments
        event = Event.find_by(id: params[:id])
        eventComments = event.comments
        comments = []
        eventComments.each do |comment|
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."event_id" = $1  [["event_id", 1]]