app/controllers/events_controller.rb

    def index
        events = Event.all
---
SELECT "events".* FROM "events"

    def create
        user = User.find_by(username: params[:event][:user])
            event = Event.new(event_params)
            event[:user_id] = user.id
            event.save
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Dan"], ["LIMIT", 1]]
INSERT INTO "events" ("title", "game", "description", "date", "location", "lat", "lng", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

    def destroy
        user = get_current_user
        ticket = user.tickets.find{|ticket| ticket.event_id == params[:id].to_i}
        ticket.destroy
---
SELECT "events".* FROM "events" INNER JOIN "tickets" ON "events"."id" = "tickets"."event_id" WHERE "tickets"."user_id" = $1  [["user_id", 1]]
SELECT "tickets".* FROM "tickets" WHERE "tickets"."user_id" = $1  [["user_id", 1]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 1]]
DELETE FROM "tickets" WHERE "tickets"."id" = $1  [["id", 8]]