app/controllers/events_controller.rb

SELECT "tickets".* FROM "tickets" WHERE "tickets"."user_id" = $1  [["user_id", 1]]
DELETE FROM "tickets" WHERE "tickets"."id" = $1  [["id", 1]]
---
    def destroy_ticket
        user = get_current_user
        ticket = user.tickets.find{|ticket| ticket.event_id == params[:id].to_i}
        ticket.destroy

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 1]]
---
    def destroy_event
        user = get_current_user
        event = Event.find_by(id: params[:id])
        event.destroy