app/controllers/tickets_controller.rb

    def create
        user = User.find_by(username: ticket_params[:user])
        ticket = Ticket.new(event_id: ticket_params[:event_id])
        ticket[:user_id] = user.id
        ticket.save
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Dan"], ["LIMIT", 1]]
INSERT INTO "tickets" ("user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["event_id", 1], ["created_at", "2020-02-21 11:30:39.060618"], ["updated_at", "2020-02-21 11:30:39.060618"]]