app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Dan"], ["LIMIT", 1]]
---
    def signin
        user = User.find_by(username: params[:username])

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "Dan"], ["password_digest", "$2a$12$Z87UYGgrvZbRClJ0EYmkmu8mhY6HPbQvpmtbjD5OlWm4cJuPQsDha"], ["created_at", "2020-02-19 12:39:55.881765"], ["updated_at", "2020-02-19 12:39:55.881765"]]
---
    def signup
        user = User.create(user_params)

SELECT "events".* FROM "events"
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def user_hosted_events
        user = get_current_user
        events = Event.select{|event| event.user == user}